cancelar_cfdi_certs/cancelar_cfdi_certs_request.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:WashOut">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:cancelar_cfdi_certs soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <username xsi:type="xsd:string">usuario</username>
         <password xsi:type="xsd:string">password</password>
         <rfcemisor xsi:type="xsd:string">AAA010101AAA</rfcemisor>
         <uuids xsi:type="urn:uuid">
            <!--Zero or more repetitions:-->
            <uuid xsi:type="xsd:string">9C6F27D1-608A-4468-B57A-AF6C293F5728</uuid>
            <uuid xsi:type="xsd:string">9C6F27D1-608A-4468-B57A-AF6C293F5727</uuid>
         </uuids>
         <cert_pem xsi:type="xsd:string">"Certificado en formato PEM"
</cert_pem>
         <llave_pem xsi:type="xsd:string">"Key en formato PEM"</llave_pem>
         <llave_password xsi:type="xsd:string">"password de key"</llave_password>
      </urn:cancelar_cfdi_certs>
   </soapenv:Body>
</soapenv:Envelope>